#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: tosuke, Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
sakuracloud_disk.k8s_rook_disk[7]: Refreshing state... [id=113602153525]
sakuracloud_disk.k8s_rook_disk[1]: Refreshing state... [id=113602153532]
sakuracloud_disk.k8s_rook_disk[6]: Refreshing state... [id=113602153520]
sakuracloud_disk.k8s_rook_disk[5]: Refreshing state... [id=113602153522]
sakuracloud_disk.k8s_rook_disk[0]: Refreshing state... [id=113602153528]
sakuracloud_disk.k8s_rook_disk[4]: Refreshing state... [id=113602153527]
sakuracloud_disk.k8s_rook_disk[2]: Refreshing state... [id=113602153526]
sakuracloud_disk.k8s_rook_disk[3]: Refreshing state... [id=113602153529]
sakuracloud_ssh_key_gen.gen_key: Refreshing state... [id=113602153508]
sakuracloud_switch.k8s_internal_switch: Refreshing state... [id=113602153509]
sakuracloud_internet.k8s_external_switch: Refreshing state... [id=113602153517]
data.sakuracloud_archive.ubuntu_archive: Reading...
data.sakuracloud_archive.ubuntu_archive: Read complete after 0s [id=113601947038]
sakuracloud_disk.k8s_control_plane_disk[1]: Refreshing state... [id=113602153524]
sakuracloud_disk.k8s_worker_node_disk[6]: Refreshing state... [id=113602153510]
sakuracloud_disk.k8s_control_plane_disk[2]: Refreshing state... [id=113602153530]
sakuracloud_disk.k8s_control_plane_disk[0]: Refreshing state... [id=113602153531]
sakuracloud_disk.k8s_worker_node_disk[4]: Refreshing state... [id=113602153516]
sakuracloud_disk.k8s_worker_node_disk[5]: Refreshing state... [id=113602153515]
sakuracloud_disk.k8s_worker_node_disk[7]: Refreshing state... [id=113602153511]
sakuracloud_disk.k8s_worker_node_disk[0]: Refreshing state... [id=113602153514]
sakuracloud_disk.k8s_worker_node_disk[3]: Refreshing state... [id=113602153513]
sakuracloud_disk.k8s_worker_node_disk[2]: Refreshing state... [id=113602153518]
sakuracloud_disk.k8s_worker_node_disk[1]: Refreshing state... [id=113602153512]
sakuracloud_vpc_router.k8s_internal_router: Refreshing state... [id=113602153533]
sakuracloud_server.k8s_control_plane[2]: Refreshing state... [id=113602153561]
sakuracloud_server.k8s_control_plane[0]: Refreshing state... [id=113602153570]
sakuracloud_server.k8s_control_plane[1]: Refreshing state... [id=113602153567]
sakuracloud_server.k8s_worker_node[3]: Refreshing state... [id=113602153551]
sakuracloud_server.k8s_worker_node[1]: Refreshing state... [id=113602153548]
sakuracloud_server.k8s_worker_node[4]: Refreshing state... [id=113602153546]
sakuracloud_server.k8s_worker_node[2]: Refreshing state... [id=113602153552]
sakuracloud_server.k8s_worker_node[6]: Refreshing state... [id=113602153549]
sakuracloud_server.k8s_worker_node[7]: Refreshing state... [id=113602153553]
sakuracloud_server.k8s_worker_node[0]: Refreshing state... [id=113602153547]
sakuracloud_server.k8s_worker_node[5]: Refreshing state... [id=113602153550]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # sakuracloud_disk.k8s_control_plane_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113602153531" -> (known after apply)
        name                 = "k8s-dev-control-plane-1"
      ~ server_id            = "113602153570" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113602153524" -> (known after apply)
        name                 = "k8s-dev-control-plane-2"
      ~ server_id            = "113602153567" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113602153530" -> (known after apply)
        name                 = "k8s-dev-control-plane-3"
      ~ server_id            = "113602153561" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602153514" -> (known after apply)
        name                 = "k8s-dev-worker-node-1"
      ~ server_id            = "113602153547" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602153512" -> (known after apply)
        name                 = "k8s-dev-worker-node-2"
      ~ server_id            = "113602153548" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602153518" -> (known after apply)
        name                 = "k8s-dev-worker-node-3"
      ~ server_id            = "113602153552" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[3] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602153513" -> (known after apply)
        name                 = "k8s-dev-worker-node-4"
      ~ server_id            = "113602153551" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[4] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602153516" -> (known after apply)
        name                 = "k8s-dev-worker-node-5"
      ~ server_id            = "113602153546" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[5] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602153515" -> (known after apply)
        name                 = "k8s-dev-worker-node-6"
      ~ server_id            = "113602153550" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[6] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602153510" -> (known after apply)
        name                 = "k8s-dev-worker-node-7"
      ~ server_id            = "113602153549" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[7] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602153511" -> (known after apply)
        name                 = "k8s-dev-worker-node-8"
      ~ server_id            = "113602153553" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_dns.k8s_dns will be created
  + resource "sakuracloud_dns" "k8s_dns" {
      + dns_servers = (known after apply)
      + id          = (known after apply)
      + zone        = "drove-dev.ictsc.net"

      + record (known after apply)
    }

  # sakuracloud_dns_record.k8s_apiserver_record will be created
  + resource "sakuracloud_dns_record" "k8s_apiserver_record" {
      + dns_id = (known after apply)
      + id     = (known after apply)
      + name   = "k8s"
      + ttl    = 300
      + type   = "A"
      + value  = "163.43.138.215"
    }

  # sakuracloud_server.k8s_control_plane[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113602153531",
        ] -> (known after apply)
        id                = "113602153570"
        name              = "k8s-dev-control-plane-1"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113602153524",
        ] -> (known after apply)
        id                = "113602153567"
        name              = "k8s-dev-control-plane-2"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113602153530",
        ] -> (known after apply)
        id                = "113602153561"
        name              = "k8s-dev-control-plane-3"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602153514",
          - "113602153528",
        ] -> (known after apply)
        id                = "113602153547"
        name              = "k8s-dev-worker-node-1"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602153512",
          - "113602153532",
        ] -> (known after apply)
        id                = "113602153548"
        name              = "k8s-dev-worker-node-2"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602153518",
          - "113602153526",
        ] -> (known after apply)
        id                = "113602153552"
        name              = "k8s-dev-worker-node-3"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[3] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602153513",
          - "113602153529",
        ] -> (known after apply)
        id                = "113602153551"
        name              = "k8s-dev-worker-node-4"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[4] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602153516",
          - "113602153527",
        ] -> (known after apply)
        id                = "113602153546"
        name              = "k8s-dev-worker-node-5"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[5] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602153515",
          - "113602153522",
        ] -> (known after apply)
        id                = "113602153550"
        name              = "k8s-dev-worker-node-6"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[6] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602153510",
          - "113602153520",
        ] -> (known after apply)
        id                = "113602153549"
        name              = "k8s-dev-worker-node-7"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[7] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602153511",
          - "113602153525",
        ] -> (known after apply)
        id                = "113602153553"
        name              = "k8s-dev-worker-node-8"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 13 to add, 11 to change, 11 to destroy.

Changes to Outputs:
  + k8s_dns_nameservers          = (known after apply)
  + k8s_dns_zone                 = "drove-dev.ictsc.net"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>